Revit 2024 API
BendingDetailDimensionTextPosition Enumeration
 Describes how the text will be positioned with respect to dimension line.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum BendingDetailDimensionTextPosition
Visual Basic
Public Enumeration BendingDetailDimensionTextPosition
Visual C++
public enum class BendingDetailDimensionTextPosition
Members
Member name | Description
Default |  The text will be positioned according to the default behavior.
OutsideOfDimensionLine |  The text will be positioned on the outside of the dimension line, where inside is represented by the bar curves.
See Also
Autodesk.Revit.DB.Structure Namespace